old/hx-auto-select-class.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-12-09 四 17:18 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>华夏学院抢课分析</title>
<meta name="author" content="shirui" />
<meta name="description" content="记录在学校抢课的事情" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" type="text/css"/>
            <link rel="stylesheet" href="/static/org.css" type="text/css"/>
            <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
            <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
            <a href="https://lampze.github.io">lampze's Blog</a>
            <span id="post-date" style="float: right">2020-03-31 二 00:00</span>
            </div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">华夏学院抢课分析</h1>
</header>
<div id="outline-container-orgdba3e0f" class="outline-2">
<h2 id="orgdba3e0f">前言</h2>
<div class="outline-text-2" id="text-orgdba3e0f">
<p>
因为我上次抢课时认真的掐准时间时间进去抢，然后发现所有的课都秒没了，
所以一怒之下就写了个脚本来帮我抢课。这次一试，果然选上了我想要的课。
</p>

<p>
其实以前选课时都是无所谓的，只要修满 10 学分就行，但最近学校要求我们三种类型的课程必须
每个都要修满 2 学分，所以有一种类型的课就变得特别难抢。
这次抢课正常抢的同学都说没有选上那种类型的，
看来早就有人写了这种脚本了。
</p>

<p>
本教程只讨论原理，不教如何使用，请自行钻研，下面我就来分析一下这个脚本怎么写的。
</p>
</div>
</div>

<div id="outline-container-org829fecc" class="outline-2">
<h2 id="org829fecc">API</h2>
<div class="outline-text-2" id="text-org829fecc">
<p>
我使用的方法是直接获取页面上的 <code>DOM</code> 然后使用 <code>DOM</code> 的 <code>click</code> 函数，比直接用后
端的接口肯定要慢许多，但我也不想把整个网页的代码看一遍，而且使用这种技术的人应该
也不多，我认为只要在 1 秒内完成就差不多了。
</p>

<p>
接下来我就趁着选课系统还未关闭开始记录下那些 <code>DOM</code> 的获取方法。
</p>

<p>
以后学校更新系统的话下面的东西可能要改，当然我是不会更新的。
</p>

<div class="org-src-container">
<pre class="src src-js">$(<span style="color: #8a3b3c;">".search-filter button"</span>)[<span style="color: #8a3b3c; font-weight: bold;">0</span>].click();     <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21015;&#20986;&#25152;&#26377;&#35838;&#31243;</span>
$(<span style="color: #8a3b3c;">"#contentBox .panel-title"</span>);             <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25152;&#26377;&#35838;&#31243;&#30340;&#26631;&#39064;</span>
$(<span style="color: #8a3b3c;">"#contentBox .panel-title"</span>)[<span style="color: #8a3b3c; font-weight: bold;">0</span>].click();  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#26174;&#31034;&#35838;&#31243;</span>
$(<span style="color: #8a3b3c;">"#contentBox .panel td.an button"</span>);      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#35838;&#31243;&#30340;&#30830;&#35748;&#25353;&#38062;</span>
loadCoursesByPaged();                      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21152;&#36733;&#21097;&#20313;&#30340;&#35838;&#31243;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8419f6e" class="outline-2">
<h2 id="org8419f6e">代码</h2>
<div class="outline-text-2" id="text-org8419f6e">
<p>
然后就可以开始写代码了，
我只实现了基本的抢课功能，没有写定时，如果没开放系统可能会把网页卡住，想改的自己改。
学校的系统是用 <code>Bootstrap</code> 和 <code>jQuery</code> 写的，不用自己导入了。
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#30495;&#23454;&#33719;&#21462;dom&#65292;&#22240;&#20026;&#21487;&#33021;&#32593;&#39029;&#27809;&#26377;&#28210;&#26579;&#23436;&#65292;dom&#27809;&#27491;&#24120;&#29983;&#25104;</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getDom</span>(<span style="color: #383a42;">name</span>) {
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25105;&#27809;&#26377;&#21152;&#33410;&#27969;&#65292;&#24819;&#24324;&#30340;&#35805;&#33258;&#24049;&#20889;</span>
  time = <span style="color: #8a3b3c; font-weight: bold;">10000</span>;
  <span style="font-weight: bold;">while</span> (!$(name).length &amp;&amp; time--);
  <span style="font-weight: bold;">return</span> $(name);
}

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">the world</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20026;&#20102;&#26041;&#20415;&#20889;&#20102;&#20010;&#30561;&#30496;&#20989;&#25968;&#65292;&#21482;&#33021;&#22312;&#21516;&#27493;&#20989;&#25968;&#37324;&#29992;&#65292;&#35745;&#37327;&#21333;&#20301;&#26159;&#27627;&#31186;</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#19981;&#24310;&#26102;&#30340;&#35805;&#65292;&#27979;&#35797;&#26102;&#24635;&#26377;&#20123;</span><span style="color: #e45649; font-weight: bold;">BUG</span><span style="color: #556b2f;">&#65292;&#30475;&#20320;&#33258;&#24049;&#20102;</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">sleep</span>(<span style="color: #383a42;">time</span>) {
  <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">new</span> <span style="font-weight: bold;">Promise</span>(resolve =&gt; setTimeout(resolve, time));
}

<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#35843;&#29992;&#36825;&#20010;&#20989;&#25968;&#23601;&#30452;&#25509;&#25250;&#35838;&#20102;&#27604;&#22914;: getClass('&#25209;&#21028;', 10)</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">want&#26159;&#19968;&#20010;&#25968;&#32452;&#65292;&#20869;&#23481;&#26159;&#35201;&#24819;&#35201;&#25250;&#30340;&#35838;&#30340;&#20851;&#38190;&#23383;</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">sleepTime&#26159;&#27599;&#27425;&#24310;&#26102;&#30340;&#26102;&#38388;&#65292;&#20027;&#35201;&#26159;&#25285;&#24515;&#27809;dom&#27809;&#29983;&#25104;&#30340;&#38382;&#39064;</span>
<span style="font-weight: bold;">async</span> <span style="font-weight: bold;">function</span> getClass(<span style="color: #383a42;">want</span>, <span style="color: #383a42;">sleepTime</span>) {
  <span style="font-weight: bold;">await</span> sleep(sleepTime);
  getDom(<span style="color: #8a3b3c;">".search-filter button"</span>)[<span style="color: #8a3b3c; font-weight: bold;">0</span>].click(); <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21015;&#20986;&#25152;&#26377;&#35838;&#31243;</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#30452;&#25509;&#21152;&#36733;10&#27425;&#65292;&#24212;&#35813;&#27809;&#26377;&#37027;&#20040;&#22810;&#35838;&#35753;&#20320;&#36873;&#30340;</span>
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">var</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; <span style="color: #8a3b3c; font-weight: bold;">10</span>; i++) {
    <span style="font-weight: bold;">await</span> sleep(sleepTime);
    loadCoursesByPaged();
  }
  <span style="font-weight: bold;">var</span> <span style="color: #383a42;">panelTitle</span> = getDom(<span style="color: #8a3b3c;">"#contentBox .panel-title"</span>); <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#33719;&#21462;&#25152;&#26377;&#35838;&#31243;&#26631;&#39064;&#30340;Dom</span>

  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#35838;&#31243;</span>
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">var</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; panelTitle.length; i++) {
    <span style="font-weight: bold;">var</span> <span style="color: #383a42;">thisTitle</span> = panelTitle[i].innerText;

    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#20851;&#38190;&#23383;&#65292;&#36873;&#25321;&#35201;&#36873;&#30340;&#35838;</span>
    <span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">var</span> <span style="color: #383a42;">j</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; j &lt; want.length; j++)
      <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#26597;&#25214;&#26159;&#21542;&#22312;&#26631;&#39064;&#20869;</span>
      <span style="font-weight: bold;">if</span> (~thisTitle.indexOf(want[j])) {
        <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25214;&#21040;&#20102;</span>
        console.log(thisTitle);

        <span style="font-weight: bold;">await</span> sleep(sleepTime);
        panelTitle[i].click(); <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#26174;&#31034;&#35838;&#31243;&#65292;&#21487;&#33021;&#21487;&#20197;&#19981;&#29992;&#23637;&#24320;&#65292;&#20294;&#25105;&#20026;&#20102;&#20445;&#38505;</span>

        <span style="font-weight: bold;">await</span> sleep(sleepTime);
        <span style="font-weight: bold;">var</span> <span style="color: #383a42;">selectDom</span> = getDom(<span style="color: #8a3b3c;">"#contentBox .panel td.an button"</span>)[i];
        <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36991;&#20813;&#36864;&#36873;</span>
        <span style="font-weight: bold;">if</span> (selectDom.innerText == <span style="color: #8a3b3c;">"&#36873;&#35838;"</span>) {
          selectDom.click(); <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36873;&#25321;&#35838;&#31243;</span>

          <span style="font-weight: bold;">await</span> sleep(sleepTime);
          getDom(<span style="color: #8a3b3c;">"#btn_confirm"</span>).click(); <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#30830;&#35748;&#36873;&#25321;</span>
        }
      }
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript" src="/static/main.js"></script>
            <center id="modi-date">2021-12-09 四 17:18</center>
</div>
</body>
</html>
